Hello,

I habe attached the following files:

From the KYPO deployment:
- openstack_base_output.txt: the output of the KYPO server deployment on
OpenStack.
- helm_deployment.vars: the variables file used for the Helm deployment.
- helm_deployment_output.txt: the output of the Helm deployment.

From the failed deployment of the following game:
https://github.com/cyberrangecz/library-demo-training
- terraform_stage.txt: the logs of the Terraform phase.
- networking_ansible_stage.txt: the logs of the Ansible phase.

From the KYPO server:
- logs.zip: the Kubernetes logs, compressed
If you need any more let me know. Please note that in logs.zip you may find
two errors that have already been corrected, both related to networking.
The first concerns a failure to resolve the hostname "controlador", and the
second concerns a failure to reach 1.1.1.1.

Thank you very much for your tim.

El jue, 19 feb 2026 a las 8:44, Tomas Sapak ***@***.***>)
escribió:

> *sapak-cshub* left a comment (cyberrangecz/issues#11)
> <https://github.com/cyberrangecz/issues/issues/11#issuecomment-3925202788>
>
> Hello. The log is incomplete. Please try to add it as an attachment.
> Kind regards
>
> Tomas
>
> —
> Reply to this email directly, view it on GitHub
> <https://github.com/cyberrangecz/issues/issues/11#issuecomment-3925202788>,
> or unsubscribe
> <https://github.com/notifications/unsubscribe-auth/AYU75P2CU4627ZVD6RWQCL34MVSVBAVCNFSM6AAAAACUY4OSLWVHI2DSMVQWIX3LMV43OSLTON2WKQ3PNVWWK3TUHMZTSMRVGIYDENZYHA>
> .
> You are receiving this because you authored the thread.Message ID:
> ***@***.***>
>

***@***.***:~/quintoDeploy/devops-tf-deployment/tf-head-services$ terraform apply -var-file tfvars/deployment.tfvars
data.terraform_remote_state.openstack_base: Reading...
module.helm.random_string.django_secret_key: Refreshing state... [id=QRKoFb0csrBV4K5hycCIfDOdKZxheaaBpZIauyrAWrMXMBMZvT]
module.helm.random_password.keycloak_password: Refreshing state... [id=none]
random_password.grafana_secret: Refreshing state... [id=none]
module.helm.random_password.django_superadmin_password: Refreshing state... [id=none]
module.helm.random_password.postgres_superadmin_password: Refreshing state... [id=none]
module.helm.random_password.guacamole_admin_password: Refreshing state... [id=none]
module.helm.random_password.guacamole_user_password: Refreshing state... [id=none]
data.terraform_remote_state.openstack_base: Read complete after 0s

Terraform used the selected providers to generate the following execution plan.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.helm.helm_release.cert_manager will be created
  + resource "helm_release" "cert_manager" {
      + atomic                     = false
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "cert-manager"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + set                        = [
          + {
              + name  = "installCRDs"
              + value = "true"
                # (1 unchanged attribute hidden)
            },
        ]
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + verify                     = false
      + version                    = "v1.16.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.helm.helm_release.certs will be created
  + resource "helm_release" "certs" {
      + atomic                     = false
      + chart                      = "crczp-certs"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "certs"
      + namespace                  = "crczp"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "oci://ghcr.io/cyberrangecz/stable"
      + reset_values               = false
      + reuse_values               = false
      + set                        = [
          + {
              + name  = "global.headHost"
              + value = "10.0.1.137"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "global.acmeContact"
              + value = ***@***.***"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "global.tlsPrivateKey"
                # (2 unchanged attributes hidden)
            },
          + {
              + name  = "global.tlsPublicKey"
                # (2 unchanged attributes hidden)
            },
          + {
              + name  = "selfSigned"
              + value = "false"
                # (1 unchanged attribute hidden)
            },
        ]
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + verify                     = false
      + version                    = "1.0.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.helm.helm_release.cnpg will be created
  + resource "helm_release" "cnpg" {
      + atomic                     = false
      + chart                      = "cloudnative-pg"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cnpg"
      + namespace                  = "cnpg-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://cloudnative-pg.github.io/charts"
      + reset_values               = false
      + reuse_values               = false
      + set                        = [
          + {
              + name  = "config.clusterWide"
              + value = "false"
                # (1 unchanged attribute hidden)
            },
        ]
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + verify                     = false
      + version                    = "0.24.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.helm.helm_release.head will be created
  + resource "helm_release" "head" {
      + atomic                     = true
      + chart                      = "crczp-head"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "head"
      + namespace                  = "crczp"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "oci://ghcr.io/cyberrangecz/stable"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 3600
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                crczp-elasticsearch:
                  pvc:
                    storageClassName: local-path
                
                crczp-guacamole:
                  guacd:
                    pvc:
                      storageClassName: local-path
                
                postgres:
                  pvc:
                    storageClassName: local-path
                
                sandbox:
                  manImage: ubuntu-noble-x86_64
                  manFlavor: standard.small
                  manUser: ubuntu
                  stackNamePrefix: default
                  osConsoleType: spice-html5
                  dnsNameServers:
                    - 10.10.13.107
            EOT,
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "2.0.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.helm.helm_release.keycloak_operator will be created
  + resource "helm_release" "keycloak_operator" {
      + atomic                     = false
      + chart                      = ".terraform/modules/helm/helm/keycloak-operator"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "keycloak-operator"
      + namespace                  = "crczp"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + verify                     = false
      + version                    = "1.0.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.helm.helm_release.postgres will be created
  + resource "helm_release" "postgres" {
      + atomic                     = false
      + chart                      = "crczp-postgres"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "postgres"
      + namespace                  = "cnpg-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "oci://ghcr.io/cyberrangecz/stable"
      + reset_values               = false
      + reuse_values               = false
      + set                        = [
          + {
              + name  = "cluster.superuserPassword"
              + value = (sensitive value)
                # (1 unchanged attribute hidden)
            },
        ]
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + jsonencode({}),
        ]
      + verify                     = false
      + version                    = "2.0.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.helm.helm_release.reloader will be created
  + resource "helm_release" "reloader" {
      + atomic                     = false
      + chart                      = "reloader"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "reloader"
      + namespace                  = "reloader"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://stakater.github.io/stakater-charts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + verify                     = false
      + version                    = "1.2.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.helm.helm_release.users will be created
  + resource "helm_release" "users" {
      + atomic                     = false
      + chart                      = "crczp-gen-users"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "gen-users"
      + namespace                  = "crczp"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "oci://ghcr.io/cyberrangecz/stable"
      + reset_values               = false
      + reuse_values               = false
      + set                        = [
          + {
              + name  = "global.headHost"
              + value = "10.0.1.137"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "global.userCount"
              + value = "100"
                # (1 unchanged attribute hidden)
            },
        ]
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + verify                     = false
      + version                    = "1.0.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 8 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "head_ip" but a value was found
│ in file "tfvars/deployment.tfvars". If you meant to use this value, add a
│ "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide certain
│ "global" settings to all configurations in your organization. To reduce the
│ verbosity of these warnings, use the -compact-warnings option.
╵

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.helm.helm_release.keycloak_operator: Creating...
module.helm.helm_release.cnpg: Creating...
module.helm.helm_release.cert_manager: Creating...
module.helm.helm_release.users: Creating...
module.helm.helm_release.reloader: Creating...
module.helm.helm_release.users: Creation complete after 2s [id=gen-users]
module.helm.helm_release.keycloak_operator: Still creating... [00m10s elapsed]
module.helm.helm_release.cnpg: Still creating... [00m10s elapsed]
module.helm.helm_release.cert_manager: Still creating... [00m10s elapsed]
module.helm.helm_release.reloader: Still creating... [00m10s elapsed]
module.helm.helm_release.keycloak_operator: Still creating... [00m20s elapsed]
module.helm.helm_release.cnpg: Still creating... [00m20s elapsed]
module.helm.helm_release.cert_manager: Still creating... [00m20s elapsed]
module.helm.helm_release.reloader: Still creating... [00m20s elapsed]
module.helm.helm_release.cnpg: Creation complete after 20s [id=cnpg]
module.helm.helm_release.postgres: Creating...
module.helm.helm_release.postgres: Creation complete after 1s [id=postgres]
module.helm.helm_release.reloader: Creation complete after 26s [id=reloader]
module.helm.helm_release.keycloak_operator: Still creating... [00m30s elapsed]
module.helm.helm_release.cert_manager: Still creating... [00m30s elapsed]
module.helm.helm_release.keycloak_operator: Creation complete after 36s [id=keycloak-operator]
module.helm.helm_release.cert_manager: Still creating... [00m40s elapsed]
module.helm.helm_release.cert_manager: Creation complete after 45s [id=cert-manager]
module.helm.helm_release.certs: Creating...
module.helm.helm_release.certs: Still creating... [00m10s elapsed]
module.helm.helm_release.certs: Creation complete after 10s [id=certs]
module.helm.helm_release.head: Creating...
module.helm.helm_release.head: Still creating... [00m10s elapsed]
module.helm.helm_release.head: Still creating... [00m20s elapsed]
module.helm.helm_release.head: Still creating... [00m30s elapsed]
module.helm.helm_release.head: Still creating... [00m40s elapsed]
module.helm.helm_release.head: Still creating... [00m50s elapsed]
module.helm.helm_release.head: Still creating... [01m00s elapsed]
module.helm.helm_release.head: Still creating... [01m10s elapsed]
module.helm.helm_release.head: Still creating... [01m20s elapsed]
module.helm.helm_release.head: Still creating... [01m30s elapsed]
module.helm.helm_release.head: Still creating... [01m40s elapsed]
module.helm.helm_release.head: Still creating... [01m50s elapsed]
module.helm.helm_release.head: Still creating... [02m00s elapsed]
module.helm.helm_release.head: Still creating... [02m10s elapsed]
module.helm.helm_release.head: Still creating... [02m20s elapsed]
module.helm.helm_release.head: Still creating... [02m30s elapsed]
module.helm.helm_release.head: Still creating... [02m40s elapsed]
module.helm.helm_release.head: Still creating... [02m50s elapsed]
module.helm.helm_release.head: Still creating... [03m00s elapsed]
module.helm.helm_release.head: Still creating... [03m10s elapsed]
module.helm.helm_release.head: Still creating... [03m20s elapsed]
module.helm.helm_release.head: Still creating... [03m30s elapsed]
module.helm.helm_release.head: Still creating... [03m40s elapsed]
module.helm.helm_release.head: Still creating... [03m50s elapsed]
module.helm.helm_release.head: Still creating... [04m00s elapsed]
module.helm.helm_release.head: Still creating... [04m10s elapsed]
module.helm.helm_release.head: Still creating... [04m20s elapsed]
module.helm.helm_release.head: Still creating... [04m30s elapsed]
module.helm.helm_release.head: Still creating... [04m40s elapsed]
module.helm.helm_release.head: Still creating... [04m50s elapsed]
module.helm.helm_release.head: Still creating... [05m00s elapsed]
module.helm.helm_release.head: Still creating... [05m10s elapsed]
module.helm.helm_release.head: Still creating... [05m20s elapsed]
module.helm.helm_release.head: Still creating... [05m30s elapsed]
module.helm.helm_release.head: Still creating... [05m40s elapsed]
module.helm.helm_release.head: Still creating... [05m50s elapsed]
module.helm.helm_release.head: Still creating... [06m00s elapsed]
module.helm.helm_release.head: Still creating... [06m10s elapsed]
module.helm.helm_release.head: Still creating... [06m20s elapsed]
module.helm.helm_release.head: Still creating... [06m30s elapsed]
module.helm.helm_release.head: Still creating... [06m40s elapsed]
module.helm.helm_release.head: Still creating... [06m50s elapsed]
module.helm.helm_release.head: Still creating... [07m00s elapsed]
module.helm.helm_release.head: Still creating... [07m10s elapsed]
module.helm.helm_release.head: Creation complete after 7m19s [id=head]

Apply complete! Resources: 8 added, 0 changed, 0 destroyed.

Outputs:

keycloak_password = <sensitive>
monitoring_admin_password = <sensitive>
***@***.***:~/quintoDeploy/devops-tf-deployment/tf-head-services$ 


data.openstack_images_image_ids_v2.image_data_source-default-p0000000001-s0000000001-client: Reading...
data.openstack_networking_secgroup_v2.sandbox-internal-sg: Reading...
data.openstack_networking_secgroup_v2.sandbox-man-int-sg: Reading...
data.openstack_networking_secgroup_v2.sandbox-man-sg: Reading...
data.openstack_networking_network_v2.base-net: Reading...
data.openstack_networking_secgroup_v2.sandbox-access-sg: Reading...
data.openstack_images_image_ids_v2.image_data_source-default-p0000000001-s0000000001-man: Reading...
data.openstack_images_image_ids_v2.image_data_source-default-p0000000001-s0000000001-router: Reading...
data.openstack_images_image_ids_v2.image_data_source-default-p0000000001-s0000000001-server: Reading...
data.openstack_networking_secgroup_v2.sandbox-internal-sg: Read complete after 0s [id=e22eb7bb-2655-4762-9fef-55cce8a93dba]
data.openstack_images_image_ids_v2.image_data_source-default-p0000000001-s0000000001-client: Read complete after 0s [id=2804112669]
data.openstack_networking_network_v2.base-net: Read complete after 0s [id=98cf594c-3a4e-41dc-b2c6-985fb49abe7b]
data.openstack_networking_secgroup_v2.sandbox-man-int-sg: Read complete after 1s [id=53df1f4f-e4c4-4c4a-a954-997ab37d2811]
data.openstack_images_image_ids_v2.image_data_source-default-p0000000001-s0000000001-man: Read complete after 1s [id=2804112669]
data.openstack_networking_secgroup_v2.sandbox-man-sg: Read complete after 1s [id=dd0a5043-d423-4b95-8459-93b9e4408509]
data.openstack_images_image_ids_v2.image_data_source-default-p0000000001-s0000000001-server: Read complete after 1s [id=2804112669]
data.openstack_networking_secgroup_v2.sandbox-access-sg: Read complete after 1s [id=a1d16aa6-fc8f-4da4-a198-d9013f85c971]
data.openstack_images_image_ids_v2.image_data_source-default-p0000000001-s0000000001-router: Read complete after 1s [id=2813931511]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # openstack_compute_instance_v2.default-p0000000001-s0000000001-client will be created
  + resource "openstack_compute_instance_v2" "default-p0000000001-s0000000001-client" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + config_drive        = true
      + created             = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "standard.small"
      + force_delete        = false
      + hypervisor_hostname = (known after apply)
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = "ubuntu-noble-x86_64"
      + key_pair            = "default-p0000000001-68bd8f75-ssh"
      + name                = "default-p0000000001-s0000000001-client"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = (known after apply)
      + stop_before_destroy = false
      + updated             = (known after apply)

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.default-p0000000001-s0000000001-man will be created
  + resource "openstack_compute_instance_v2" "default-p0000000001-s0000000001-man" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + config_drive        = true
      + created             = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "standard.small"
      + force_delete        = false
      + hypervisor_hostname = (known after apply)
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = "ubuntu-noble-x86_64"
      + key_pair            = "default-p0000000001-68bd8f75-ssh"
      + name                = "default-p0000000001-s0000000001-man"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = (known after apply)
      + stop_before_destroy = false
      + updated             = (known after apply)

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.default-p0000000001-s0000000001-router will be created
  + resource "openstack_compute_instance_v2" "default-p0000000001-s0000000001-router" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + config_drive        = true
      + created             = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "standard.small"
      + force_delete        = false
      + hypervisor_hostname = (known after apply)
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = "debian-12-x86_64"
      + key_pair            = "default-p0000000001-68bd8f75-ssh"
      + name                = "default-p0000000001-s0000000001-router"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = (known after apply)
      + stop_before_destroy = false
      + updated             = (known after apply)

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.default-p0000000001-s0000000001-server will be created
  + resource "openstack_compute_instance_v2" "default-p0000000001-s0000000001-server" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + config_drive        = true
      + created             = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "standard.small"
      + force_delete        = false
      + hypervisor_hostname = (known after apply)
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = "ubuntu-noble-x86_64"
      + key_pair            = "default-p0000000001-68bd8f75-ssh"
      + name                = "default-p0000000001-s0000000001-server"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = (known after apply)
      + stop_before_destroy = false
      + updated             = (known after apply)

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_networking_network_v2.default-p0000000001-s0000000001-client-switch will be created
  + resource "openstack_networking_network_v2" "default-p0000000001-s0000000001-client-switch" {
      + admin_state_up          = true
      + all_tags                = (known after apply)
      + availability_zone_hints = (known after apply)
      + dns_domain              = (known after apply)
      + external                = (known after apply)
      + id                      = (known after apply)
      + mtu                     = (known after apply)
      + name                    = "default-p0000000001-s0000000001-client-switch"
      + port_security_enabled   = (known after apply)
      + qos_policy_id           = (known after apply)
      + region                  = (known after apply)
      + shared                  = (known after apply)
      + tenant_id               = (known after apply)
      + transparent_vlan        = (known after apply)

      + segments (known after apply)
    }

  # openstack_networking_network_v2.default-p0000000001-s0000000001-man-network will be created
  + resource "openstack_networking_network_v2" "default-p0000000001-s0000000001-man-network" {
      + admin_state_up          = true
      + all_tags                = (known after apply)
      + availability_zone_hints = (known after apply)
      + dns_domain              = (known after apply)
      + external                = (known after apply)
      + id                      = (known after apply)
      + mtu                     = (known after apply)
      + name                    = "default-p0000000001-s0000000001-man-network"
      + port_security_enabled   = (known after apply)
      + qos_policy_id           = (known after apply)
      + region                  = (known after apply)
      + shared                  = (known after apply)
      + tenant_id               = (known after apply)
      + transparent_vlan        = (known after apply)

      + segments (known after apply)
    }

  # openstack_networking_network_v2.default-p0000000001-s0000000001-server-switch will be created
  + resource "openstack_networking_network_v2" "default-p0000000001-s0000000001-server-switch" {
      + admin_state_up          = true
      + all_tags                = (known after apply)
      + availability_zone_hints = (known after apply)
      + dns_domain              = (known after apply)
      + external                = (known after apply)
      + id                      = (known after apply)
      + mtu                     = (known after apply)
      + name                    = "default-p0000000001-s0000000001-server-switch"
      + port_security_enabled   = (known after apply)
      + qos_policy_id           = (known after apply)
      + region                  = (known after apply)
      + shared                  = (known after apply)
      + tenant_id               = (known after apply)
      + transparent_vlan        = (known after apply)

      + segments (known after apply)
    }

  # openstack_networking_network_v2.default-p0000000001-s0000000001-wan will be created
  + resource "openstack_networking_network_v2" "default-p0000000001-s0000000001-wan" {
      + admin_state_up          = true
      + all_tags                = (known after apply)
      + availability_zone_hints = (known after apply)
      + dns_domain              = (known after apply)
      + external                = (known after apply)
      + id                      = (known after apply)
      + mtu                     = (known after apply)
      + name                    = "default-p0000000001-s0000000001-wan"
      + port_security_enabled   = (known after apply)
      + qos_policy_id           = (known after apply)
      + region                  = (known after apply)
      + shared                  = (known after apply)
      + tenant_id               = (known after apply)
      + transparent_vlan        = (known after apply)

      + segments (known after apply)
    }

  # openstack_networking_port_v2.default-p0000000001-s0000000001-link-1 will be created
  + resource "openstack_networking_port_v2" "default-p0000000001-s0000000001-link-1" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "default-p0000000001-s0000000001-link-1"
      + network_id             = (known after apply)
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = [
          + "dd0a5043-d423-4b95-8459-93b9e4408509",
        ]
      + tenant_id              = (known after apply)

      + allowed_address_pairs {
          + ip_address = "192.168.128.0/17"
        }

      + binding (known after apply)

      + fixed_ip {
          + subnet_id = (known after apply)
        }
    }

  # openstack_networking_port_v2.default-p0000000001-s0000000001-link-10 will be created
  + resource "openstack_networking_port_v2" "default-p0000000001-s0000000001-link-10" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "default-p0000000001-s0000000001-link-10"
      + network_id             = (known after apply)
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = [
          + "e22eb7bb-2655-4762-9fef-55cce8a93dba",
        ]
      + tenant_id              = (known after apply)

      + allowed_address_pairs {
          + ip_address = "0.0.0.0/0"
        }

      + binding (known after apply)

      + fixed_ip {
          + ip_address = "192.168.30.1"
          + subnet_id  = (known after apply)
        }
    }

  # openstack_networking_port_v2.default-p0000000001-s0000000001-link-2 will be created
  + resource "openstack_networking_port_v2" "default-p0000000001-s0000000001-link-2" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "default-p0000000001-s0000000001-link-2"
      + network_id             = (known after apply)
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = [
          + "e22eb7bb-2655-4762-9fef-55cce8a93dba",
        ]
      + tenant_id              = (known after apply)

      + allowed_address_pairs {
          + ip_address = "0.0.0.0/0"
        }

      + binding (known after apply)

      + fixed_ip {
          + subnet_id = (known after apply)
        }
    }

  # openstack_networking_port_v2.default-p0000000001-s0000000001-link-3 will be created
  + resource "openstack_networking_port_v2" "default-p0000000001-s0000000001-link-3" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "default-p0000000001-s0000000001-link-3"
      + network_id             = (known after apply)
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = [
          + "53df1f4f-e4c4-4c4a-a954-997ab37d2811",
        ]
      + tenant_id              = (known after apply)

      + allowed_address_pairs {
          + ip_address = "192.168.128.0/17"
        }

      + binding (known after apply)

      + fixed_ip {
          + subnet_id = (known after apply)
        }
    }

  # openstack_networking_port_v2.default-p0000000001-s0000000001-link-4 will be created
  + resource "openstack_networking_port_v2" "default-p0000000001-s0000000001-link-4" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "default-p0000000001-s0000000001-link-4"
      + network_id             = (known after apply)
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = [
          + "53df1f4f-e4c4-4c4a-a954-997ab37d2811",
        ]
      + tenant_id              = (known after apply)

      + allowed_address_pairs {
          + ip_address = "192.168.128.0/17"
        }

      + binding (known after apply)

      + fixed_ip {
          + subnet_id = (known after apply)
        }
    }

  # openstack_networking_port_v2.default-p0000000001-s0000000001-link-5 will be created
  + resource "openstack_networking_port_v2" "default-p0000000001-s0000000001-link-5" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "default-p0000000001-s0000000001-link-5"
      + network_id             = (known after apply)
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = [
          + "e22eb7bb-2655-4762-9fef-55cce8a93dba",
        ]
      + tenant_id              = (known after apply)

      + allowed_address_pairs {
          + ip_address = "192.168.20.0/24"
        }

      + binding (known after apply)

      + fixed_ip {
          + ip_address = "192.168.20.5"
          + subnet_id  = (known after apply)
        }
    }

  # openstack_networking_port_v2.default-p0000000001-s0000000001-link-6 will be created
  + resource "openstack_networking_port_v2" "default-p0000000001-s0000000001-link-6" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "default-p0000000001-s0000000001-link-6"
      + network_id             = (known after apply)
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = [
          + "e22eb7bb-2655-4762-9fef-55cce8a93dba",
        ]
      + tenant_id              = (known after apply)

      + allowed_address_pairs {
          + ip_address = "192.168.30.0/24"
        }

      + binding (known after apply)

      + fixed_ip {
          + ip_address = "192.168.30.5"
          + subnet_id  = (known after apply)
        }
    }

  # openstack_networking_port_v2.default-p0000000001-s0000000001-link-7 will be created
  + resource "openstack_networking_port_v2" "default-p0000000001-s0000000001-link-7" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "default-p0000000001-s0000000001-link-7"
      + network_id             = (known after apply)
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = [
          + "53df1f4f-e4c4-4c4a-a954-997ab37d2811",
        ]
      + tenant_id              = (known after apply)

      + allowed_address_pairs {
          + ip_address = "192.168.128.0/17"
        }

      + binding (known after apply)

      + fixed_ip {
          + subnet_id = (known after apply)
        }
    }

  # openstack_networking_port_v2.default-p0000000001-s0000000001-link-8 will be created
  + resource "openstack_networking_port_v2" "default-p0000000001-s0000000001-link-8" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "default-p0000000001-s0000000001-link-8"
      + network_id             = (known after apply)
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = [
          + "e22eb7bb-2655-4762-9fef-55cce8a93dba",
        ]
      + tenant_id              = (known after apply)

      + allowed_address_pairs {
          + ip_address = "0.0.0.0/0"
        }

      + binding (known after apply)

      + fixed_ip {
          + subnet_id = (known after apply)
        }
    }

  # openstack_networking_port_v2.default-p0000000001-s0000000001-link-9 will be created
  + resource "openstack_networking_port_v2" "default-p0000000001-s0000000001-link-9" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "default-p0000000001-s0000000001-link-9"
      + network_id             = (known after apply)
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = [
          + "e22eb7bb-2655-4762-9fef-55cce8a93dba",
        ]
      + tenant_id              = (known after apply)

      + allowed_address_pairs {
          + ip_address = "0.0.0.0/0"
        }

      + binding (known after apply)

      + fixed_ip {
          + ip_address = "192.168.20.1"
          + subnet_id  = (known after apply)
        }
    }

  # openstack_networking_port_v2.default-p0000000001-s0000000001-man-out-port will be created
  + resource "openstack_networking_port_v2" "default-p0000000001-s0000000001-man-out-port" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "default-p0000000001-s0000000001-man-out-port"
      + network_id             = "98cf594c-3a4e-41dc-b2c6-985fb49abe7b"
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = [
          + "a1d16aa6-fc8f-4da4-a198-d9013f85c971",
        ]
      + tenant_id              = (known after apply)

      + allowed_address_pairs {
          + ip_address = "0.0.0.0/0"
        }

      + binding (known after apply)
    }

  # openstack_networking_subnet_v2.default-p0000000001-s0000000001-client-switch-subnet will be created
  + resource "openstack_networking_subnet_v2" "default-p0000000001-s0000000001-client-switch-subnet" {
      + all_tags          = (known after apply)
      + cidr              = "192.168.30.0/24"
      + dns_nameservers   = [
          + "10.10.13.107",
        ]
      + enable_dhcp       = true
      + gateway_ip        = "192.168.30.1"
      + id                = (known after apply)
      + ip_version        = 4
      + ipv6_address_mode = (known after apply)
      + ipv6_ra_mode      = (known after apply)
      + name              = "default-p0000000001-s0000000001-client-switch-subnet"
      + network_id        = (known after apply)
      + no_gateway        = false
      + region            = (known after apply)
      + service_types     = (known after apply)
      + tenant_id         = (known after apply)

      + allocation_pool (known after apply)
    }

  # openstack_networking_subnet_v2.default-p0000000001-s0000000001-man-network-subnet will be created
  + resource "openstack_networking_subnet_v2" "default-p0000000001-s0000000001-man-network-subnet" {
      + all_tags          = (known after apply)
      + cidr              = "192.168.128.0/17"
      + dns_nameservers   = [
          + "10.10.13.107",
        ]
      + enable_dhcp       = true
      + gateway_ip        = (known after apply)
      + id                = (known after apply)
      + ip_version        = 4
      + ipv6_address_mode = (known after apply)
      + ipv6_ra_mode      = (known after apply)
      + name              = "default-p0000000001-s0000000001-man-network-subnet"
      + network_id        = (known after apply)
      + no_gateway        = true
      + region            = (known after apply)
      + service_types     = (known after apply)
      + tenant_id         = (known after apply)

      + allocation_pool (known after apply)
    }

  # openstack_networking_subnet_v2.default-p0000000001-s0000000001-server-switch-subnet will be created
  + resource "openstack_networking_subnet_v2" "default-p0000000001-s0000000001-server-switch-subnet" {
      + all_tags          = (known after apply)
      + cidr              = "192.168.20.0/24"
      + dns_nameservers   = [
          + "10.10.13.107",
        ]
      + enable_dhcp       = true
      + gateway_ip        = "192.168.20.1"
      + id                = (known after apply)
      + ip_version        = 4
      + ipv6_address_mode = (known after apply)
      + ipv6_ra_mode      = (known after apply)
      + name              = "default-p0000000001-s0000000001-server-switch-subnet"
      + network_id        = (known after apply)
      + no_gateway        = false
      + region            = (known after apply)
      + service_types     = (known after apply)
      + tenant_id         = (known after apply)

      + allocation_pool (known after apply)
    }

  # openstack_networking_subnet_v2.default-p0000000001-s0000000001-wan-subnet will be created
  + resource "openstack_networking_subnet_v2" "default-p0000000001-s0000000001-wan-subnet" {
      + all_tags          = (known after apply)
      + cidr              = "100.100.100.0/24"
      + dns_nameservers   = [
          + "10.10.13.107",
        ]
      + enable_dhcp       = true
      + gateway_ip        = (known after apply)
      + id                = (known after apply)
      + ip_version        = 4
      + ipv6_address_mode = (known after apply)
      + ipv6_ra_mode      = (known after apply)
      + name              = "default-p0000000001-s0000000001-wan-subnet"
      + network_id        = (known after apply)
      + no_gateway        = true
      + region            = (known after apply)
      + service_types     = (known after apply)
      + tenant_id         = (known after apply)

      + allocation_pool (known after apply)
    }

Plan: 23 to add, 0 to change, 0 to destroy.
openstack_networking_network_v2.default-p0000000001-s0000000001-client-switch: Creating...
openstack_networking_port_v2.default-p0000000001-s0000000001-man-out-port: Creating...
openstack_networking_network_v2.default-p0000000001-s0000000001-wan: Creating...
openstack_networking_network_v2.default-p0000000001-s0000000001-man-network: Creating...
openstack_networking_network_v2.default-p0000000001-s0000000001-server-switch: Creating...
openstack_networking_network_v2.default-p0000000001-s0000000001-client-switch: Creation complete after 1s [id=8abb70df-b06e-4add-aa0a-8a649f49ceda]
openstack_networking_network_v2.default-p0000000001-s0000000001-wan: Creation complete after 1s [id=e8217421-5fe5-4526-9be9-6fb7de9ce8df]
openstack_networking_network_v2.default-p0000000001-s0000000001-man-network: Creation complete after 1s [id=cda050e5-b14a-40b6-be9c-0415b499b535]
openstack_networking_subnet_v2.default-p0000000001-s0000000001-client-switch-subnet: Creating...
openstack_networking_subnet_v2.default-p0000000001-s0000000001-wan-subnet: Creating...
openstack_networking_subnet_v2.default-p0000000001-s0000000001-man-network-subnet: Creating...
openstack_networking_port_v2.default-p0000000001-s0000000001-man-out-port: Creation complete after 1s [id=a0728067-d4c1-4907-a073-4eebcae712b6]
openstack_networking_subnet_v2.default-p0000000001-s0000000001-client-switch-subnet: Creation complete after 1s [id=851bbcae-21ad-467d-842a-ecae57f526d1]
openstack_networking_port_v2.default-p0000000001-s0000000001-link-10: Creating...
openstack_networking_port_v2.default-p0000000001-s0000000001-link-6: Creating...
openstack_networking_subnet_v2.default-p0000000001-s0000000001-wan-subnet: Creation complete after 1s [id=90a689fd-fbc8-4859-8aa9-741ee0b0cd8d]
openstack_networking_port_v2.default-p0000000001-s0000000001-link-8: Creating...
openstack_networking_port_v2.default-p0000000001-s0000000001-link-2: Creating...
openstack_networking_subnet_v2.default-p0000000001-s0000000001-man-network-subnet: Creation complete after 1s [id=ac90c16a-052b-45c6-abac-eaf7a45bee7f]
openstack_networking_port_v2.default-p0000000001-s0000000001-link-3: Creating...
openstack_networking_port_v2.default-p0000000001-s0000000001-link-1: Creating...
openstack_networking_port_v2.default-p0000000001-s0000000001-link-4: Creating...
openstack_networking_port_v2.default-p0000000001-s0000000001-link-7: Creating...
openstack_networking_network_v2.default-p0000000001-s0000000001-server-switch: Creation complete after 2s [id=3a6a95c5-65f4-43ca-94ca-439ce8783c9e]
openstack_networking_subnet_v2.default-p0000000001-s0000000001-server-switch-subnet: Creating...
openstack_networking_port_v2.default-p0000000001-s0000000001-link-6: Creation complete after 0s [id=f715e3db-2b11-4d8e-9079-d066c8587d29]
openstack_networking_port_v2.default-p0000000001-s0000000001-link-10: Creation complete after 0s [id=11a89b47-9e59-4306-adc7-2e0fa0ba3695]
openstack_networking_subnet_v2.default-p0000000001-s0000000001-server-switch-subnet: Creation complete after 0s [id=c5d679a5-8c13-4a17-8c5a-d7fc7c48b92f]
openstack_networking_port_v2.default-p0000000001-s0000000001-link-9: Creating...
openstack_networking_port_v2.default-p0000000001-s0000000001-link-8: Creation complete after 0s [id=ad020512-5db6-46e4-92ed-004b87d2df03]
openstack_networking_port_v2.default-p0000000001-s0000000001-link-5: Creating...
openstack_networking_port_v2.default-p0000000001-s0000000001-link-2: Creation complete after 0s [id=d60a1615-6da3-41c8-9c4c-87c58eeb7a9d]
openstack_networking_port_v2.default-p0000000001-s0000000001-link-7: Creation complete after 0s [id=8601e4c4-a0d5-4dfd-b8c2-cf5db124e09a]
openstack_networking_port_v2.default-p0000000001-s0000000001-link-1: Creation complete after 0s [id=53fc8da0-d6ac-4c8a-9156-4eacb0f78368]
openstack_networking_port_v2.default-p0000000001-s0000000001-link-4: Creation complete after 0s [id=8f855b2f-1ae6-4c2e-976e-5c8176ae7fec]
openstack_compute_instance_v2.default-p0000000001-s0000000001-client: Creating...
openstack_compute_instance_v2.default-p0000000001-s0000000001-man: Creating...
openstack_networking_port_v2.default-p0000000001-s0000000001-link-3: Creation complete after 0s [id=5fc42a2e-e1c7-4c37-a2fe-b789baa274be]
openstack_networking_port_v2.default-p0000000001-s0000000001-link-5: Creation complete after 0s [id=2a923c49-d567-4f7e-9ac2-ef2169ea5683]
openstack_networking_port_v2.default-p0000000001-s0000000001-link-9: Creation complete after 0s [id=e07dfb5b-f47d-4298-8c74-9607c9d9aece]
openstack_compute_instance_v2.default-p0000000001-s0000000001-server: Creating...
openstack_compute_instance_v2.default-p0000000001-s0000000001-router: Creating...
openstack_compute_instance_v2.default-p0000000001-s0000000001-client: Still creating... [10s elapsed]
openstack_compute_instance_v2.default-p0000000001-s0000000001-man: Still creating... [10s elapsed]
openstack_compute_instance_v2.default-p0000000001-s0000000001-server: Still creating... [10s elapsed]
openstack_compute_instance_v2.default-p0000000001-s0000000001-router: Still creating... [10s elapsed]
openstack_compute_instance_v2.default-p0000000001-s0000000001-client: Still creating... [20s elapsed]
openstack_compute_instance_v2.default-p0000000001-s0000000001-man: Still creating... [20s elapsed]
openstack_compute_instance_v2.default-p0000000001-s0000000001-server: Still creating... [20s elapsed]
openstack_compute_instance_v2.default-p0000000001-s0000000001-router: Still creating... [20s elapsed]
openstack_compute_instance_v2.default-p0000000001-s0000000001-router: Creation complete after 24s [id=53dbbf24-1359-4340-83e2-ac4a12f8785f]
openstack_compute_instance_v2.default-p0000000001-s0000000001-man: Still creating... [30s elapsed]
openstack_compute_instance_v2.default-p0000000001-s0000000001-client: Still creating... [30s elapsed]
openstack_compute_instance_v2.default-p0000000001-s0000000001-server: Still creating... [30s elapsed]
openstack_compute_instance_v2.default-p0000000001-s0000000001-client: Creation complete after 33s [id=e60bc17f-1107-40a6-b34d-13a28da2c399]
openstack_compute_instance_v2.default-p0000000001-s0000000001-server: Creation complete after 33s [id=a35b33b6-262b-4ab8-880d-b26210f758bd]
openstack_compute_instance_v2.default-p0000000001-s0000000001-man: Creation complete after 34s [id=eb8c6e80-1136-4698-9b8e-59ba8616dab8]

Apply complete! Resources: 23 added, 0 changed, 0 destroyed.

***@***.***:~/quintoDeploy/devops-tf-deployment/tf-openstack-base$ tofu apply -var-file tfvars/deployment.tfvars -var-file tfvars/vars-all.tfvars
module.openstack_base.openstack_networking_secgroup_v2.proxy: Refreshing state... [id=41b519fb-a37e-447b-818f-3331b3e4da16]
module.openstack_base.openstack_networking_secgroup_v2.sandbox_man: Refreshing state... [id=fee3a52d-e716-44b9-87d9-e520b30cee65]
module.images.openstack_images_image_v2.kali[0]: Refreshing state... [id=c8227df4-f258-449e-84c2-8ffd400639fd]
module.flavors[0].openstack_compute_flavor_v2.standard_large: Refreshing state... [id=4d5bc4ce-97a1-4178-99f7-10eed2eaee14]
module.openstack_base.tls_private_key.admin: Refreshing state... [id=72bd8818caff77a45fb28bb3d5944c04174141f6]
module.openstack_base.openstack_networking_secgroup_v2.sandbox_access: Refreshing state... [id=8807028b-4981-4b58-97b9-eae00bae4517]
module.openstack_base.data.openstack_networking_network_v2.external_network: Reading...
module.flavors[0].openstack_compute_flavor_v2.standard_medium: Refreshing state... [id=697cc727-800f-4cac-8e03-84b546fcfc36]
module.openstack_base.openstack_networking_network_v2.network: Refreshing state... [id=d75c7c93-10b4-4073-9921-0fddad4032a1]
module.images.openstack_images_image_v2.noble: Refreshing state... [id=d61ecdb8-de3e-4ecd-b66d-328113633407]
module.images.openstack_images_image_v2.debian_12: Refreshing state... [id=33e2fb76-a31e-48b8-a4b2-30c893912a16]
module.openstack_base.openstack_networking_secgroup_v2.head: Refreshing state... [id=685e047f-bc19-4009-a1ed-6f6757ba21f4]
module.openstack_base.openstack_networking_secgroup_v2.sandbox_internal: Refreshing state... [id=a01e9d89-7e9e-45b8-b564-68dd20ce33db]
module.openstack_base.openstack_networking_secgroup_v2.sandbox_man_int: Refreshing state... [id=f39c6a37-8e74-4906-ace7-73ee7653393e]
module.openstack_base.data.openstack_identity_auth_scope_v3.scope: Reading...
module.openstack_base.data.openstack_identity_auth_scope_v3.scope: Read complete after 0s [id=my_scope]
module.flavors[0].openstack_compute_flavor_v2.standard_small: Refreshing state... [id=79c71237-0de6-41c1-b9f0-e781e58ee6df]
module.openstack_base.openstack_networking_se